Repository: processout/processout-ios
Catalog: Sources/ProcessOut/Resources/Strings/*.lproj/ProcessOut.strings
Languages: fr, pl, pt_pt

# native-alternative-payment.title
source: Pay with %@
fr: Payer avec %@
pl: Zapłać przy pomocy %@
pt_pt: Pagar com %@

# native-alternative-payment.success.message
source: Success! Payment approved
fr: Succès ! Paiement confirmé.
pl: Sukces! Płatność przyjęta
pt_pt: Successo! Pagamento aprovado.

# native-alternative-payment.email.placeholder
source: name@example.com
fr: nom@exemple.fr
pl: imię@przykład.pl
pt_pt: nome@exemplo.pt

# native-alternative-payment.phone.placeholder
source: Enter phone number
fr: Entrez votre numéro de téléphone
pl: Twój numer telefonu
pt_pt: Insira o seu número de telemóvel

# native-alternative-payment.submit-button.title
source: Pay %@
fr: Payer %@
pl: Zapłać %@
pt_pt: Pagar %@

# native-alternative-payment.submit-button.default-title
source: Pay
fr: Payer
pl: Zapłać
pt_pt: Pagar

# native-alternative-payment.cancel-button.title
source: Cancel
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# native-alternative-payment.error.required-parameter
source: Parameter is required.
fr: Paramètre requis
pl: Parametr jest wmagany
pt_pt: Campo obrigatório

# native-alternative-payment.error.invalid-number
source: Number is not valid.
fr: Numéro invalide
pl: Niepoprawny numer
pt_pt: Número inválido

# native-alternative-payment.error.invalid-value
source: Value is not valid.
pl: Niepoprawna wartość
pt_pt: Texto inválido

# native-alternative-payment.error.invalid-email
source: Email is not valid.
fr: Votre adresse e-mail est invalide
pl: Niepoprawny adres email
pt_pt: Endereço de e-mail inválido

# native-alternative-payment.error.invalid-phone
source: Phone number is not valid.
fr: Votre numéro de téléphone est invalide
pl: Niepoprawny numer telefonu
pt_pt: Número de telemóvel inválido

# test-3-d-s.challenge.title
source: Do you want to accept the 3DS2 challenge?
fr: Voulez-vous accepter le défi 3DS2 ?
pl: Czy chcesz przyjąć wyzwanie 3DS2?
pt_pt: Você quer aceitar o desafio 3DS2?

# test-3-d-s.challenge.accept
source: Accept
fr: Accepter
pl: Zaakceptować
pt_pt: Aceitar

# test-3-d-s.challenge.reject
source: Reject
fr: Rejeter
pl: Odrzucić
pt_pt: Rejeitar

# card-tokenization.title
source: Add New Card
pl: Dodaj nową kartę
pt_pt: Adicionar novo cartão

# card-tokenization.card-details.title
source: Card Information
pl: Informacja o karcie
pt_pt: Dados do cartão

# card-tokenization.card-details.expiration.placeholder
source: MM / YY
pl: MM / RR
pt_pt: MM / AA

# card-tokenization.card-details.cardholder.placeholder
source: Cardholder Name
pl: Imię i nazwisko na karcie
pt_pt: Nome no cartão

# card-tokenization.error.card
source: Your card information is invalid.
pl: Niepoprawna informacja o karcie
pt_pt: Os dados do seu cartão são inválidos.

# card-tokenization.error.card-number
source: Your card number is invalid.
pl: Nieprawidłowy numer karty
pt_pt: O número do seu cartão é inválido.

# card-tokenization.error.card-expiration
source: Your card expiration date is invalid.
pl: Data ważności karty jest nieprawidłowa
pt_pt: A data de validade do seu cartão é inválida.

# card-tokenization.error.track-data
source: Your card expiration date and/or CVC is invalid.
pl: Data ważności karty oraz/lub kod CVC są nieprawidłowe
pt_pt: A data de validade e/ou o código de segurança do seu cartão são inválidos.

# card-tokenization.error.cvc
source: Your card CVC is invalid.
pl: Nieprawidłowy numer CVC
pt_pt: O código de segurança do seu cartão é inválido.

# card-tokenization.error.cardholder-name
source: The cardholder name is invalid.
pl: Niepoprawne imię i nazwisko na karcie
pt_pt: O nome no cartão é inválido.

# card-tokenization.error.generic
source: Something went wrong, please try again.
pl: Coś poszło nie tak, spróbuj ponownie
pt_pt: Ocorreu um erro ao processar o seu cartão, por favor tente novamente.

# card-tokenization.submit-button.title
source: Submit
pl: Zatwierdź
pt_pt: Enviar

# card-tokenization.cancel-button.title
source: Cancel
pl: Anuluj
pt_pt: Cancelar
